chon-concert-with-tricot-polyphia-and-ttng.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>CHON concert (with Tricot, Polyphia, and TTNG)</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Bryan Garza">
<meta name="description" content="Account of the CHON concert in San Francisco"
>
<meta name="keywords" content="math rock, live music, concert">

<link href="./css/styles2.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="./css/styles.css"/>
</head>
<body>
<div id="preamble" class="status">
<h1 class="title"><a href="http://bryangarza.github.io">Bryan Garza</a></h1>
</div>
<div id="content">
<p>
<div class="outline-3"><h3><a href="./chon-concert-with-tricot-polyphia-and-ttng.html"> CHON concert (with Tricot, Polyphia, and TTNG)</a><span> </span><span class="timestamp-wrapper"><span class="timestamp">( July 26, 2018)</span></span></h3>
</p>

<p>
Last month I went to the CHON concert in SF with a friend. <a href="http://tricot.tv/">Tricot</a> is my favorite
band and there was no way I was going to miss the chance to see them live. It
was an amazing show. Tricot&rsquo;s set was a bit short but they played some of my
favorite songs including <b>18,19</b>. Being in a crowd where everyone is immersed in
the music is a strange feeling, like when you get shivers down your
spine. Towards the end of the concert we went to buy some merch and Tricot was
there, so I met them and we took a picture together. Really surprised that even
happened, isn&rsquo;t it rare for bands to just hang out after their set?
</p>

<p>
Next, I want to see <a href="http://www.motfd.com/">Mass of the Fermenting Dregs</a>. They just released a new album
(titled <i>No New World</i>) after 8 years. It&rsquo;s so damn good x_x. Hopefully I can
catch a show when I visit Japan.
</p>

<p>
</div>
</p>
</div>
<div id="postamble" class="status">
<a href="archive.html">Archive</a>
</div>
</body>
</html>
